In [1]:
# .dt() methods

import numpy as np
import pandas as pd

from datetime import datetime

In [2]:
# Base python datetime

my_year = 2015
my_month = 1
my_day = 1
my_hour = 2
my_min = 39
my_sec = 15

In [7]:
mydate = datetime(my_year, my_month, my_day, my_hour, my_min, my_sec)
mydate

datetime.datetime(2015, 1, 1, 2, 39, 15)

In [9]:
mydate.year

2015

In [10]:
# Pandas Datetime

myser = pd.Series(['Nov 3, 1990', '2000-01-01', None])

In [11]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [12]:
myser[0]

'Nov 3, 1990'

In [15]:
# Identify dates

timeser = pd.to_datetime(myser)

In [16]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [17]:
timeser[0].year

1990

In [18]:
euro_date = '31-12-2000'
pd.to_datetime(euro_date)

Timestamp('2000-12-31 00:00:00')

In [20]:
euro_date = '10-12-2000'
pd.to_datetime(euro_date) # this method is designed by a American developer, so the result
                          # won't make sense.

Timestamp('2000-10-12 00:00:00')

In [22]:
# To correct this kind of missunderstandings:

pd.to_datetime(euro_date, dayfirst = True ) # European date system check!.

Timestamp('2000-12-10 00:00:00')

In [26]:
style_date = '12--Dec--2000'

In [30]:
pd.to_datetime(style_date, format = '%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [31]:
custom_date = '12th of Dec 2000'

In [32]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [33]:
sales = pd.read_csv('F:\\Machine Learning\\ML Udemy\\Course Notebooks\\03-Pandas\\RetailSales_BeerWineLiquor.csv')

In [34]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [36]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [37]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [38]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [40]:
# The advantage of a datetime object vs a normal string is, we can recall an specific day,
# month, year of an specific row.

sales['DATE'][0].year

1992

In [52]:
# We can convert a column of normal objects to datetime objects as we read the csv file.
# we only need to add the argument parse = ['name of the columns'] or = [direction of the column]

sales2 = pd.read_csv('F:\\Machine Learning\\ML Udemy\\Course Notebooks\\03-Pandas\\RetailSales_BeerWineLiquor.csv', parse_dates = ['DATE'])

In [45]:
sales2['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [54]:
sales2 = sales2.set_index('DATE')

In [55]:
sales2

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [61]:
# This sort by year and calculate the mean value of each year.
# There are different rules A, B, C, D ... check the panda's documentation

sales.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [65]:
# .dt.year/month/day method

sales2 = pd.read_csv('F:\\Machine Learning\\ML Udemy\\Course Notebooks\\03-Pandas\\RetailSales_BeerWineLiquor.csv', parse_dates = ['DATE'])

In [63]:
sales2['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [64]:
sales2['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64